lkolbly/cmsis-svd/data/ADI/ADuCM363.svd
				<register>
					<name>T2WUFA0</name>
					<description>Wake up field A  LSB.</description>
					<addressOffset>0x0000003C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00001900</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFA1</name>
					<description>Wake up field A MSB.</description>
					<addressOffset>0x00000040</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_CLKCTL</name>
			<description>Clock Control</description>
			<groupName>CLKCTL</groupName>
			<baseAddress>0x40002000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x448</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLKCON0</name>
					<description>System clocking architecture control register</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLKOUT</name>
							<description>GPIO output clock multiplexer select bits</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>UCLKCG</name>
                     <description>UCLKCG</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UCLK</name>
                     <description>UCLK</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PCLK</name>
                     <description>PCLK</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFOSC</name>
                     <description>HFOSC</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC</name>
                     <description>LFOSC</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXTAL</name>
                     <description>LFXTAL</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKMUX</name>
							<description>Digital subsystem clock source select bits.</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>HFOSC</name>
                     <description>HFOSC</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXTAL</name>
                     <description>LFXTAL</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC</name>
                     <description>LFOSC</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTCLK</name>
                     <description>EXTCLK</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CD</name>
							<description>Clock divide bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
                     <description>DIV1</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
                     <description>DIV2</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
                     <description>DIV4</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
                     <description>DIV8</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
                     <description>DIV16</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
                     <description>DIV32</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
                     <description>DIV64</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
                     <description>DIV128</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKCON1</name>
					<description>System Clocks Control Register 1</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PWMCD</name>
							<description>Clock divide bits for PWM system clock</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
                     <description>DIV1</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
                           <description>DIV2</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
                     <description>DIV4</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
                     <description>DIV8</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
                     <description>DIV16</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
                     <description>DIV32</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
                     <description>DIV64</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
                     <description>DIV128</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UART0CD</name>
							<description>Clock divide bits for UART0 system clock</description>
							<bitOffset>9</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
                     <description>DIV1</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
                     <description>DIV2</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
                     <description>DIV4</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
                     <description>DIV8</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
                     <description>DIV16</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
                     <description>DIV32</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
                     <description>DIV64</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
                     <description>DIV128</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2CCD</name>
							<description>Clock divide bits for I2C system clock</description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
                     <description>DIV1</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
                     <description>DIV2</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
                     <description>DIV4</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
                     <description>DIV8</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
                     <description>DIV16</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
                     <description>DIV32</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
                     <description>DIV64</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
                     <description>DIV128</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI1CD</name>
							<description>Clock divide bits for SPI1 system clock</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
                     <description>DIV1</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
                     <description>DIV2</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
                     <description>DIV4</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
                     <description>DIV8</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
                     <description>DIV16</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
                     <description>DIV32</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
                     <description>DIV64</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
                     <description>DIV128</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI0CD</name>
							<description>Clock divide bits for SPI0 system clock</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
                     <description>DIV1</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
                     <description>DIV2</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
                     <description>DIV4</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
                     <description>DIV8</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
                     <description>DIV16</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
                     <description>DIV32</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
                     <description>DIV64</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
                     <description>DIV128</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKDIS</name>
					<description>System Clocks Control Register 1</description>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x0000FFFF</resetValue>
					<fields>
						<field>
							<name>DISADCCLK</name>
							<description>Disable ADC system clock</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISDMACLK</name>
							<description>Disable DMA system clock</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISDACCLK</name>
							<description>Disable DAC system clock</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIST1CLK</name>
							<description>Disable Timer 1 system clock</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIST0CLK</name>
							<description>Disable Timer 0 system clock</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISPWMCLK</name>
							<description>Disable PWM system clock</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISUART0CLK</name>
							<description>Disable UART0 system clock</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISI2CCLK</name>
							<description>Disable I2C system clock</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISSPI1CLK</name>
							<description>Disable SPI1 system clock</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISSPI0CLK</name>
							<description>Disable SPI0 system clock bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                           <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
