lkolbly/cmsis-svd/data/ADI/ADuCM363.svd
				<register>
					<name>COMMSR</name>
             <description>Modem Status register</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000008</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DCD</name>
							<description>Data Carrier Detect.</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RI</name>
							<description>Ring Indicator.</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSR</name>
							<description>Data Set Ready.</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTS</name>
							<description>Clear To Send.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DDCD</name>
							<description>Delta DCD.</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TERI</name>
							<description>Trailing Edge RI.</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DDSR</name>
							<description>Delta DSR.</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCTS</name>
							<description>Delta CTS.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>COMFBR</name>
             <description>Fractional baud rate divider register.</description>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVM</name>
							<description>Fractional M Divide bits</description>
							<bitOffset>11</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                      </range>
                 </writeConstraint>
						</field>
						<field>
							<name>DIVN</name>
							<description>Fractional N Divide bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000007FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>COMDIV</name>
             <description>Baud rate Divisor register</description>
					<addressOffset>0x00000028</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Sets the baudrate</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>COMCON</name>
             <description>UART control register</description>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000008</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DISABLE</name>
							<description>Uart Disable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
