lkolbly/cmsis-svd/data/ADI/ADuCM363.svd
				<register>
					<name>GP2TGL</name>
					<description>GPIO Port 2 pin toggle.</description>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000008</size>
             <access>write-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TGL7</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL6</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL5</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL4</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL3</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL2</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL1</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL0</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_ANA</name>
			<description>Analog Control</description>
			<groupName>ANA</groupName>
			<baseAddress>0x40008810</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x78</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>REFCTRL</name>
             <description>Internal Reference Control register</description>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REFPD</name>
							<description>Power down reference</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IEXCCON</name>
             <description>Controls the on-chip Excitation Current Sources</description>
					<addressOffset>0x00000040</addressOffset>
					<size>0x00000008</size>
             <resetValue>0x000000C0</resetValue>
					<fields>
						<field>
							<name>PD</name>
							<description>IEXC Power down- bits</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>En</name>
                     <description>En</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off</name>
                     <description>off</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFSEL</name>
							<description>IREF Source- bits</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>Ext</name>
                     <description>Ext</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
                     <description>Int</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IPSEL1</name>
							<description>Select IEXC1 pin AIN- bits</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
                     <description>Off</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN4</name>
                     <description>AIN4</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN5</name>
                     <description>AIN5</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN6</name>
                     <description>AIN6</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN7</name>
                     <description>AIN7</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IPSEL0</name>
							<description>Select IEXC0 pin AIN- bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
                     <description>Off</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN4</name>
                     <description>AIN4</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN5</name>
                     <description>AIN5</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN6</name>
                     <description>AIN6</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN7</name>
                     <description>AIN7</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IEXCDAT</name>
             <description>Sets the output current setting for both Excitation Current sources</description>
					<addressOffset>0x00000044</addressOffset>
					<size>0x00000008</size>
             <resetValue>0x00000006</resetValue>
					<fields>
						<field>
							<name>IDAT</name>
							<description>Output Current- bits</description>
							<bitOffset>1</bitOffset>
							<bitWidth>5</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>0uA</name>
                     <description>0uA</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50uA</name>
                     <description>50uA</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>100uA</name>
                     <description>100uA</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>150uA</name>
                     <description>150uA</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200uA</name>
                     <description>200uA</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>250uA</name>
                     <description>250uA</description>
									<value>20</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>300uA</name>
                     <description>300uA</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400uA</name>
                     <description>400uA</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>450uA</name>
                     <description>450uA</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>500uA</name>
                     <description>500uA</description>
									<value>21</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>600uA</name>
                     <description>600uA</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>750uA</name>
                     <description>750uA</description>
									<value>22</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>800uA</name>
                     <description>800uA</description>
									<value>19</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1mA</name>
                     <description>1mA</description>
									<value>31</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDAT0</name>
							<description>10uA Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
